docs/rar.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rar</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org625f8ef">
<div class="navbar-brand" id="org8a71974">
<div class="navbar-item" id="org0531ba9">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="orga2bb60c">
<div class="navbar-start" id="org9228a85">
<div class="navbar-item" id="orgf1a9d7c">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="orgdbeb7d1">

</div>

</div>
</nav>
<div id="outline-container-orgb837ffc" class="outline-2">
<h2 id="orgb837ffc">rar</h2>
<div class="outline-text-2" id="text-orgb837ffc">
<ul class="org-ul">
<li>proprietary format</li>
<li>supports encryption, error correction, file spanning</li>
<li>SRR rescene
<ul class="org-ul">
<li>can reconstruct original rars from original data + srr</li>
<li><a href="https://www.srrdb.com/">https://www.srrdb.com/</a>
<ul class="org-ul">
<li><a href="irc://irc.efnet.org/%23srrdb">//irc.efnet.org/%23srrdb</a> for support verifying</li>
</ul></li>
<li>pyReScene is python port of .Net app
<ul class="org-ul">
<li><a href="https://github.com/srrDB/pyrescene">https://github.com/srrDB/pyrescene</a></li>
</ul></li>
<li><a href="https://www.xrel.to/">https://www.xrel.to/</a> has proofs images for reconstruction</li>
</ul></li>
<li>SRS scene resample
<ul class="org-ul">
<li>can reconstruct sample from original rar data
<ul class="org-ul">
<li>bluray samples not supported (.m2ts)</li>
</ul></li>
</ul></li>
<li>rarfs
<ul class="org-ul">
<li>can mount rars as fuse filesystem
<ul class="org-ul">
<li><code>rar2fs source dest -o allow_other</code></li>
<li>fusermount -u dest</li>
<li><a href="https://github.com/hasse69/rar2fs">https://github.com/hasse69/rar2fs</a></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>